In [1]:
import pandas as pd
import numpy as np

In [ ]:
DataFrame.mode(axis=0, numeric_only=False, dropna=True)
Get the mode(s) of each element along the selected axis.

axis : {0 or ‘index’, 1 or ‘columns’}, default 0

numeric_only : bool, default False
               If True, only apply to numeric columns.

dropna       : bool, default True
               Don’t consider counts of NaN/NaT.

Check column-A and look for most repeated values. If there are multiple values of same repeated list them on sorted order

In [71]:
df = pd.DataFrame([('bird', 2, 2),
                   ('mammal', 4, np.nan),
                   ('arthropod', 8, 0),
                   ('bird', 2, np.nan)],
                  index=('falcon', 'horse', 'spider', 'ostrich'),
                  columns=('species', 'legs', 'wings'))
df

           species  legs  wings
falcon        bird     2    2.0
horse       mammal     4    NaN
spider   arthropod     8    0.0
ostrich       bird     2    NaN

In [73]:
df.mode()

  species  legs  wings
0    bird   2.0    0.0
1     NaN   NaN    2.0

In [74]:
df.mode(dropna=False)

  species  legs  wings
0    bird     2    NaN

In [77]:
df.mode(numeric_only=True)

   legs  wings
0   2.0    0.0
1   NaN    2.0

In [78]:
df.mode(axis='columns', numeric_only=True)

           0    1
falcon   2.0  NaN
horse    4.0  NaN
spider   0.0  8.0
ostrich  2.0  NaN

In [70]:
df.mode(dropna=False)

   species   legs  wings
0      1.0    2.0      1
1    333.0  444.0      2
2      NaN    NaN      3
3      NaN    NaN      4
4      NaN    NaN      5
5      NaN    NaN      6
6      NaN    NaN      7